In [4]:
import pandas as pd

In [6]:
s = pd.Series(['banana',42])

In [8]:
s

0    banana
1        42
dtype: object

In [10]:
pd.Series(
    data=['Wes Mckinney','creator of pandas'],
    index=['Person','Who']
)

Person         Wes Mckinney
Who       creator of pandas
dtype: object

In [13]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [15]:
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [23]:
scientists.index
# 시작값, 끝값, 증가값

RangeIndex(start=0, stop=2, step=1)

In [19]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [25]:
scientists.values
# 배열로 리턴

array([['Rosaline Franklin', 'Chemist', '1920-07-25', '1958-04-16', 37],
       ['William Gosset', 'Statistician', '1876-06-13', '1937-10-16', 61]],
      dtype=object)

In [31]:
scientists['Age'].mean()

49.0

In [39]:
scientists['Age'].sort_values(ascending=False)

1    61
0    37
Name: Age, dtype: int64

In [41]:
scientists['Age'].to_frame()

   Age
0   37
1   61

In [45]:
scientists.transpose()

                            0               1
Name        Rosaline Franklin  William Gosset
Occupation            Chemist    Statistician
Born               1920-07-25      1876-06-13
Died               1958-04-16      1937-10-16
Age                        37              61

In [47]:
sci = pd.read_csv('../data/scientists.csv')

In [49]:
sci

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [51]:
sci.head(1)

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist

In [53]:
sci.tail(1)

           Name        Born        Died  Age     Occupation
7  Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [55]:
sci.sample()

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist

In [57]:
sci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [61]:
sci.describe()
# 문자열로 된 값은 출력안됨 / 숫자값만 출력

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [69]:
sci['Age'] > sci['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [71]:
sci[sci['Age'] > sci['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [73]:
ss=sci['Age'] > sci['Age'].mean()

In [75]:
list(ss)

[False, True, True, True, False, False, False, True]

In [77]:
sci[[False, True, True, True, False, False, False, True]]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [79]:
ages = sci['Age']

In [81]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [83]:
ages+ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [85]:
ages+10

0     47
1     71
2    100
3     76
4     66
5     55
6     51
7     87
Name: Age, dtype: int64

In [87]:
ages+ pd.Series([1,2])

0    38.0
1    63.0
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
dtype: float64

In [95]:
sci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   Born_dt     8 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 516.0+ bytes

In [93]:
sci['Born_dt']=pd.to_datetime(sci['Born'],format='%Y-%m-%d')